"""
Создать список и заполнить его элементами различных типов данных.
Реализовать скрипт проверки типа данных каждого элемента.
Использовать функцию type() для проверки типа.
Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.
"""

l = ['list', 123, (1,2,3), [1,]]
for i in range(len(l)):
    print(type(l[i]))


